//Дати
//Да се напише програма, която поддържа текстов диалогов режим,
// позволяващ удобен интерактивен избор на серия от операции с дати:
//въвеждане на дата от клавиатурата и проверка за коректност
//извеждане на дата на екрана в избран от потребителя формат
//допустими формати: dd/MM/yyyy -> 20/04/2021
//			     MM/dd/yyyy -> 04/20/2021
//			    dd-MMM-yyyy -> 04-Feb-2021
//по дата да се определи ден от седмицата
//по описание с ден от седмицата да се определи датата, която отговаря на него, например:
//втората събота от месец февруари
//последният понеделник от месец януари
//отпечатва календар за даден месец
//календарът да се извежда прегледно, като си личи коя дата на кой ден от седмицата отговаря
//При стартиране на програмата потребителя въвежда кой ден от седмицата е 1 януари и спрямо този ден
// динамично се генерира календара до края на годината.
// Денят се въвежда като число от 1 до 7, като 1 отговаря на понеделник, а 7 на неделя.
// Предварително се знае, че годината е високосна.
//Реализацията на всички функции трябва да се съдържа в дадена програма,
// не е позволено използването на системна библиотека за работа с дати.

import java.util.Scanner;
//public class KremiCalendar {

    public class Main {

        public static void main(String[] args) {
            Scanner scan = new Scanner(System.in);
            System.out.print("Enter full year: ");

            int year = scan.nextInt();
            System.out.print("Enter month in number between 1 and 12: ");

            int month = scan.nextInt();
            System.out.print("Enter day: ");

            int day = scan.nextInt();

            if (month < 1 || month > 12 || year < 1980)
                System.out.println("Wrong input!");
            else
                System.out.println("year, month, day");

        }
    }

